// prisma/seed.js
import { PrismaClient } from '@prisma/client';
const prisma = new PrismaClient();

const predefinedStudents = [
  { name: 'يوسف سامر محمد حبيب', id: '23110021062' },
  { name: 'هاشم احمد هاشم سعود', id: '23110021061' },
  { name: 'نور الزهراء ضياء عبد الامير حسن', id: '23110021060' },
  { name: 'نبأ حيدر طاهر علي', id: '23110021059' },
  { name: 'مهدي حافظ علي اسماعيل', id: '23110021058' },
  { name: 'مصطفى باسم محمد جبار', id: '23110021057' },
  { name: 'محسن محمد يونس علوان', id: '23110021056' },
  { name: 'فاضل عباس محمود عبد الرضا', id: '23110021055' },
  { name: 'فارس عبد الله عبد الكاظم جبير', id: '23110021054' },
  { name: 'غدير هادي ابراهيم علي', id: '23110021053' },
  { name: 'علي قحطان سلطان حلان', id: '23110021052' },
  { name: 'عامر محمد عبد الرضا عباس', id: '23110021051' },
  { name: 'طه حمزه عبيس رسن', id: '23110021050' },
  { name: 'صادق حيدر مطشر خضير', id: '23110021049' },
  { name: 'سجاد حيدر نزال ثويني', id: '23110021048' },
  { name: 'ساره علي ادريس عبد المطلب', id: '23110021047' },
  { name: 'زينة سفير نايف سلوم', id: '23110021046' },
  { name: 'زينب صباح كاظم ناجي', id: '23110021045' },
  { name: 'رسل خضر عبد الحمزه مطلب', id: '23110021044' },
  { name: 'حيدر علي نجم عبد الله', id: '23110021043' },
  { name: 'حنين كاظم جمعه فرحان', id: '23110021042' },
  { name: 'حسين علي حسن وحيد', id: '23110021041' },
  { name: 'جمانه علي محمد صابر', id: '23110021040' },
  { name: 'بركات علاء عارف حلو', id: '23110021039' },
  { name: 'بتول حيدر ادريس عبد المطلب', id: '23110021038' },
  { name: 'باقر حيدر وحودي عريبي', id: '23110021037' },
  { name: 'أنوار سالم جهاد حسون', id: '23110021036' },
  { name: 'ايه رعد عمران كاظم', id: '23110021035' },
  { name: 'ايه جهاد عبد الله طالب', id: '23110021034' },
  { name: 'ايات عبد الله كاطع', id: '23110021412' },
  { name: 'اسراء نهاد مطير رجا', id: '23110021411' },
  { name: 'احمد خالد ناجي حمزه', id: '23110021410' },
  { name: 'احمد حيدر كاظم سلطان', id: '23110021409' },
  { name: 'اثمار علي عبد هاشم', id: '23110021408' },
  { name: 'ابرار حسن خليف جاسم', id: '23110021407' },
  { name: 'ايلاف عباس قاسم كاظم', id: '23110021413' },
  { name: 'بنين صباح علي قاسم', id: '23110021414' },
  { name: 'حسناء عليوي جاسم راهي', id: '23110021415' },
  { name: 'حسنين محمد جاسم حسين', id: '23110021416' },
  { name: 'رباب باسم عبد الرزاق عزيز', id: '23110021417' },
  { name: 'رحمه رجب حميد حسن', id: '23110021418' },
  { name: 'زهراء سلمان عبدالحر حسين', id: '23110021420' },
  { name: 'زهراء عبد الامير محمد مهاوش', id: '23110021421' },
  { name: 'زهراء عبد الله رجب عبد الحسن', id: '23110021422' },
  { name: 'زينب حامد هاشم علي', id: '23110021423' },
  { name: 'سجى وسام صاحب موسى', id: '23110021424' },
  { name: 'سكينه خضر خليل محمد علي', id: '23110021425' },
  { name: 'صفا حيدر علي شكر', id: '23110021426' },
  { name: 'عبد الحسين قاسم جبر ادريس', id: '23110021427' },
  { name: 'عبد الله فائز شاكر حنون', id: '23110021428' },
  { name: 'غدير حميد عزيز محمد', id: '23110021429' },
  { name: 'فاطمه عطوان هاشم خدام', id: '23110021430' },
  { name: 'محمد حامد كطان جواد', id: '23110021431' },
  { name: 'محمد حسين جهاد سلمان', id: '23110021432' },
  { name: 'محمد نعمة محمد حسين', id: '23110021433' },
  { name: 'مصطفى عماد نور بادي', id: '23110021434' },
  { name: 'مصطفى مهدي جليل مهدي', id: '23110021435' },
  { name: 'هدى حيدر نجم عبدعلي', id: '23110021436' },
  { name: 'هيام صالح شلاقه شافي', id: '23110021437' },
];

async function main() {
  console.log('Start seeding...');

  for (const student of predefinedStudents) {
    await prisma.student.upsert({
      where: { id: student.id },
      update: {},
      create: {
        id: student.id,
        name: student.name,
      },
    });
  }

  console.log('Seeding finished.');
}

main()
  .catch((e) => {
    console.error(e);
    process.exit(1);
  })
  .finally(async () => {
    await prisma.$disconnect();
  });
